{
  "title": {
    "text": {
      "headline": "Permissiviness",
      "text": "<p class=lead>What is wrong with Open source?</p>A timeline about OSS permissiviness."
    },
    "background": {
      "url": "https://www.dedoimedo.com/images/computers_years/2013_2/linux-world-map-second-colored.png",
      "alt": "The Great Linux World Map 2.0 by Dedoimedo"
    }
  },
  "eras": [
    {
      "start_date": {
        "year": "1985"
      },
      "end_date": {
        "year": "1990"
      },
      "text": {
        "headline": "Foundations Era"
      }
    },
    {
      "start_date": {
        "year": "1990"
      },
      "end_date": {
        "year": "2000"
      },
      "text": {
        "headline": "Web 1.0 Era"
      }
    },
    {
      "start_date": {
        "year": "2000"
      },
      "end_date": {
        "year": "2010"
      },
      "text": {
        "headline": "Web 2.0 & Early Cloud Era"
      }
    },
    {
      "start_date": {
        "year": "2010"
      },
      "end_date": {
        "year": "2020"
      },
      "text": {
        "headline": "Cloud-Native Era"
      }
    },
    {
      "start_date": {
        "year": "2020"
      },
      "end_date": {
        "year": "2025"
      },
      "text": {
        "headline": "Next-Gen(AI) Cloud Era"
      }
    }
  ],
  "events": [
    {
      "group": "Events",
      "start_date": {
        "year": "1969",
        "month": "10",
        "day": "29"
      },
      "text": {
        "headline": "ARPANET first message sent",
        "text": "The first ARPANET message is sent between UCLA and Stanford, marking the birth of the internet and establishing the foundation for open networking protocols."
      }
    },
    {
      "group": "Permissiveness",
      "start_date": {
        "year": "1988"
      },
      "text": {
        "headline": "MIT License formalized",
        "text": "The MIT License is formalized as one of the most permissive open source licenses, allowing unlimited freedom including proprietary use, becoming a template for maximum permissiveness."
      }
    },
    {
      "group": "Events",
      "start_date": {
        "year": "1989",
        "month": "3"
      },
      "text": {
        "headline": "World Wide Web proposal",
        "text": "Tim Berners-Lee submits his proposal for the World Wide Web at CERN, creating the foundation for open web standards and information sharing."
      }
    },
    {
      "group": "Freedom",
      "start_date": {
        "year": "1985",
        "month": "3"
      },
      "text": {
        "headline": "GNU Manifesto published, FSF founded",
        "text": "Richard Stallman publishes the GNU Manifesto and founds the Free Software Foundation (FSF) to promote free software principles, emphasizing user freedom over proprietary control."
      }
    },
    {
      "group": "Freedom",
      "start_date": {
        "year": "1989",
        "month": "6"
      },
      "text": {
        "headline": "GPL v1.0 released",
        "text": "The GNU General Public License version 1.0 is released, establishing the first strong copyleft license that ensures derivative works remain free and open source."
      }
    },
    {
      "group": "Permissiveness",
      "start_date": {
        "year": "1990"
      },
      "text": {
        "headline": "BSD License emerges as permissive alternative",
        "text": "The Berkeley Software Distribution license gains prominence, offering a permissive alternative to GPL that allows proprietary derivatives, establishing the foundation for the copyleft vs. permissive licensing divide."
      }
    },
    {
      "group": "Events",
      "start_date": {
        "year": "1991",
        "month": "8",
        "day": "25"
      },
      "text": {
        "headline": "Linux kernel first released",
        "text": "Linus Torvalds announces the first version of the Linux kernel, initially released under his own license before adopting GPL v2 in 1992, establishing the model for collaborative kernel development."
      }
    },
    {
      "group": "Freedom",
      "start_date": {
        "year": "1992",
        "month": "1"
      },
      "text": {
        "headline": "Linux adopts GPL v2",
        "text": "Linux kernel switches from Torvalds' original license to GPL v2, ensuring that all kernel contributions remain free and open source, setting a precedent for large collaborative projects."
      }
    },
    {
      "group": "Freedom",
      "start_date": {
        "year": "1991",
        "month": "6"
      },
      "text": {
        "headline": "GPL v2.0 released",
        "text": "GPL version 2.0 is released, refining copyleft principles and becoming the most widely adopted strong copyleft license, used by the Linux kernel and thousands of projects."
      }
    },
    {
      "group": "Permissiveness",
      "start_date": {
        "year": "1995",
        "month": "6"
      },
      "text": {
        "headline": "Apache HTTP Server released",
        "text": "The Apache HTTP Server is released, becoming one of the first major projects to use a permissive license, setting the stage for the Apache Software Foundation and permissive licensing model."
      }
    },
    {
      "group": "Permissiveness",
      "start_date": {
        "year": "1998",
        "month": "2"
      },
      "text": {
        "headline": "Open Source Initiative founded",
        "text": "The Open Source Initiative (OSI) is founded by Eric Raymond and Bruce Perens, coining the term 'Open Source' as a business-friendly alternative to 'Free Software'."
      }
    },
    {
      "group": "Permissiveness",
      "start_date": {
        "year": "1999",
        "month": "3"
      },
      "text": {
        "headline": "Apache Software Foundation founded",
        "text": "The Apache Software Foundation (ASF) is incorporated, promoting the Apache License as a permissive alternative to copyleft licenses and establishing a new governance model for open source projects."
      }
    },
    {
      "group": "Permissiveness",
      "start_date": {
        "year": "2000"
      },
      "text": {
        "headline": "InnerSource coined by Tim O'Reilly",
        "text": "Tim O'Reilly coins the term 'InnerSource', describing the application of open source practices within organizations to improve collaboration and innovation."
      }
    },
    {
      "group": "Permissiveness",
      "start_date": {
        "year": "2004"
      },
      "text": {
        "headline": "Web 2.0 Conference and open source adoption",
        "text": "Tim O'Reilly's Web 2.0 Conference popularizes the term. Companies like Google, Facebook, and others build their platforms on open source foundations while creating proprietary services on top."
      }
    },
    {
      "group": "Permissiveness",
      "start_date": {
        "year": "2004"
      },
      "text": {
        "headline": "Steven Weber publishes The Success of Open Source",
        "text": "Steven Weber publishes The Success of Open Source, highlighting business opportunities in community-driven models and the economic advantages of permissive licensing for corporate adoption."
      }
    },
    {
      "group": "Events",
      "start_date": {
        "year": "2006",
        "month": "3"
      },
      "text": {
        "headline": "Amazon Web Services launches",
        "text": "AWS launches with S3 and EC2, pioneering cloud computing and creating the infrastructure that will later enable cloud providers to monetize open source software without contributing back."
      }
    },
    {
      "group": "Freedom",
      "start_date": {
        "year": "2007",
        "month": "6"
      },
      "text": {
        "headline": "GPL v3.0 released",
        "text": "GPL version 3.0 is released, addressing digital rights management and software patents, but faces resistance from projects like Linux kernel due to its additional restrictions."
      }
    },
    {
      "group": "Freedom",
      "start_date": {
        "year": "2007",
        "month": "11"
      },
      "text": {
        "headline": "GNU AGPL v3.0 published",
        "text": "The GNU Affero General Public License (AGPL) v3.0 is published, extending copyleft to network-delivered software and attempting to close the 'web services loophole' in traditional GPL."
      }
    },
    {
      "group": "Permissiveness",
      "start_date": {
        "year": "2007",
        "month": "11"
      },
      "text": {
        "headline": "Android Open Source Project launched",
        "text": "Google releases Android under Apache License 2.0, demonstrating how permissive licenses enable proprietary extensions while maintaining an open core, setting a template for mobile OS development."
      }
    },
    {
      "group": "Events",
      "start_date": {
        "year": "2008",
        "month": "4"
      },
      "text": {
        "headline": "GitHub launched",
        "text": "GitHub is launched, democratizing access to Git repositories and making open source collaboration more accessible, while building a proprietary platform on top of open source tools."
      }
    },
    {
      "group": "Proprietariness",
      "start_date": {
        "year": "2008"
      },
      "text": {
        "headline": "Andrew Lampitt coins 'Open Core'",
        "text": "Andrew Lampitt coins the term 'Open Core', describing a business model where a core product is open source, but additional features or services are proprietary."
      }
    },
    {
      "group": "Permissiveness",
      "start_date": {
        "year": "2009"
      },
      "text": {
        "headline": "The shift toward permissive licensing accelerates",
        "text": "Major projects like Hadoop, and later OpenStack, adopt Apache-style licenses. Mike Olson argues that permissive licenses foster mass adoption over GPL's protective approach."
      }
    },
    {
      "group": "Proprietariness",
      "start_date": {
        "year": "2013",
        "month": "3"
      },
      "text": {
        "headline": "Docker launches with open core model",
        "text": "Docker is released as open source, pioneering containerization while building a commercial platform around the open source engine, exemplifying the open core business model."
      }
    },
    {
      "group": "Events",
      "start_date": {
        "year": "2012",
        "month": "7"
      },
      "text": {
        "headline": "HashiCorp founded",
        "text": "Mitchell Hashimoto and Armon Dadgar found HashiCorp, beginning with Vagrant and later building infrastructure tools like Terraform, Consul, and Vault under open source licenses."
      }
    },
    {
      "group": "Proprietariness",
      "start_date": {
        "year": "2012"
      },
      "text": {
        "headline": "Growth of the Open Core model",
        "text": "The Open Core model gains popularity, with companies like GitHub, Docker, and others adopting it to balance community contributions with commercial interests."
      }
    },
    {
      "group": "Proprietariness",
      "start_date": {
        "year": "2009"
      },
      "text": {
        "headline": "MongoDB launches with AGPL license",
        "text": "MongoDB is released under AGPL license to prevent cloud providers from offering it as a service without contributing back, but enforcement proves challenging as cloud adoption grows."
      }
    },
    {
      "group": "Proprietariness",
      "start_date": {
        "year": "2013",
        "month": "07"
      },
      "text": {
        "headline": "Movable Type Open Source initiative ends."
      }
    },
    {
      "group": "Proprietariness",
      "start_date": {
        "year": "2014"
      },
      "text": {
        "headline": "SugarCRM Open Source initiative ends."
      }
    },
    {
      "group": "Events",
      "start_date": {
        "year": "2018",
        "month": "1"
      },
      "text": {
        "headline": "Red Hat acquires CoreOS for $250M",
        "text": "Red Hat acquires CoreOS, gaining container expertise and the CoreOS Linux distribution, while consolidating its position in the enterprise Linux and container ecosystem."
      }
    },
    {
      "group": "Events",
      "start_date": {
        "year": "2018",
        "month": "6"
      },
      "text": {
        "headline": "Microsoft acquires GitHub for $7.5B",
        "text": "Microsoft's acquisition of GitHub marks a shift toward 'Microsoft loves Linux' strategy, while raising concerns about a proprietary company controlling the world's largest open source platform."
      }
    },
    {
      "group": "Proprietariness",
      "start_date": {
        "year": "2018",
        "month": "8"
      },
      "text": {
        "headline": "Redis modules adopt Apache 2.0 + Commons Clause",
        "text": "Redis Labs adds the Commons Clause to some Redis modules under Apache 2.0, restricting commercial use and sparking controversy about open source licensing."
      }
    },
    {
      "group": "Proprietariness",
      "start_date": {
        "year": "2018",
        "month": "10"
      },
      "text": {
        "headline": "MongoDB adopts SSPL",
        "text": "MongoDB, Inc. introduces the Server Side Public License (SSPL), a controversial license that restricts cloud providers from offering MongoDB as a service without contributing back to the community."
      }
    },
    {
      "group": "Proprietariness",
      "start_date": {
        "year": "2018",
        "month": "9"
      },
      "text": {
        "headline": "Confluent adopts Confluent Community License",
        "text": "Confluent introduces the Confluent Community License (CCL) for Kafka components, allowing source access but restricting commercial competitive use, sparking debate about 'open source washing'."
      }
    },
    {
      "group": "Proprietariness",
      "start_date": {
        "year": "2019",
        "month": "3"
      },
      "text": {
        "headline": "Redis adopts RSAL and SSPL",
        "text": "Redis Labs transitions from Commons Clause to Redis Source Available License (RSAL) and SSPL for some modules, continuing to restrict cloud provider usage."
      }
    },
    {
      "group": "Proprietariness",
      "start_date": {
        "year": "2019",
        "month": "6"
      },
      "text": {
        "headline": "CockroachDB adopts BUSL",
        "text": "Cockroach Labs adopts the Business Source License (BUSL) for CockroachDB, allowing free use with restrictions on competitive commercial services, introducing a time-based conversion to Apache 2.0."
      }
    },
    {
      "group": "Proprietariness",
      "start_date": {
        "year": "2019",
        "month": "11"
      },
      "text": {
        "headline": "Sentry adopts BUSL",
        "text": "Sentry adopts the Business Source License (BUSL) for its core product, following the trend of developer tools companies seeking to prevent cloud providers from competing directly."
      }
    },
    {
      "group": "Events",
      "start_date": {
        "year": "2019",
        "month": "7"
      },
      "text": {
        "headline": "IBM completes Red Hat acquisition for $34B",
        "text": "IBM completes its acquisition of Red Hat for $34 billion, the largest software acquisition in history, promising to maintain Red Hat's open source commitment and independence."
      }
    },
    {
      "group": "Permissiveness",
      "start_date": {
        "year": "2019",
        "month": "1"
      },
      "text": {
        "headline": "AWS launches DocumentDB",
        "text": "AWS launches DocumentDB (MongoDB-compatible), prompting MongoDB's SSPL adoption. Later AWS responds to Elasticsearch's license change with OpenSearch fork."
      }
    },
    {
      "group": "Proprietariness",
      "start_date": {
        "year": "2021",
        "month": "1"
      },
      "text": {
        "headline": "Elastic adopts dual license Elastic/SSPL",
        "text": "Elastic NV changes Elasticsearch and Kibana to dual licensing under Elastic License 2.0 and SSPL, restricting cloud provider usage and prompting AWS to fork OpenSearch."
      }
    },
    {
      "group": "Events",
      "start_date": {
        "year": "2021",
        "month": "6"
      },
      "text": {
        "headline": "GitHub Copilot preview launched",
        "text": "GitHub launches Copilot, an AI coding assistant trained on billions of lines of public code, raising questions about fair use of open source code for commercial AI training."
      }
    },
    {
      "group": "Events",
      "start_date": {
        "year": "2021",
        "month": "12"
      },
      "text": {
        "headline": "HashiCorp goes public",
        "text": "HashiCorp goes public on NASDAQ, raising $1.2 billion while maintaining its open source infrastructure tools, setting the stage for later licensing tensions with cloud providers."
      }
    },
    {
      "group": "Permissiveness",
      "start_date": {
        "year": "2021"
      },
      "text": {
        "headline": "AI growth accelerates OSS exploitation",
        "text": "Permissive licenses fuel AI training datasets; massive code and data scraping becomes normalized across Google, Meta, OpenAI. Traditional IP protections struggle to keep pace."
      }
    },
    {
      "group": "Events",
      "start_date": {
        "year": "2022",
        "month": "11",
        "day": "30"
      },
      "text": {
        "headline": "ChatGPT launches",
        "text": "OpenAI launches ChatGPT, demonstrating the power of large language models trained on vast amounts of open source code and data, raising questions about fair use and attribution."
      }
    },
    {
      "group": "Permissiveness",
      "start_date": {
        "year": "2023"
      },
      "text": {
        "headline": "AI companies use permissive licenses without reciprocity",
        "text": "Large AI companies like OpenAI, Google, and Meta train models on vast amounts of open source code and data under permissive licenses, often without contributing back improvements or acknowledging sources."
      }
    },
    {
      "group": "Proprietariness",
      "start_date": {
        "year": "2023",
        "month": "6"
      },
      "text": {
        "headline": "Red Hat restricts RHEL source code access",
        "text": "Red Hat announces it will only make RHEL source code available to paying customers, effectively ending public access and violating the spirit of GPL while technically remaining compliant."
      }
    },
    {
      "group": "Proprietariness",
      "start_date": {
        "year": "2023",
        "month": "7"
      },
      "text": {
        "headline": "Rocky Linux and AlmaLinux adapt to RHEL changes",
        "text": "Rocky Linux and AlmaLinux, the CentOS replacements, announce they will shift from RHEL source to alternative sources like CentOS Stream and upstream packages to continue their RHEL-compatible distributions."
      }
    },
    {
      "group": "Proprietariness",
      "start_date": {
        "year": "2023",
        "month": "8"
      },
      "text": {
        "headline": "HashiCorp changes Terraform to BSL",
        "text": "HashiCorp changes Terraform from Mozilla Public License 2.0 to Business Source License (BSL), restricting competitive commercial use and sparking controversy in the infrastructure-as-code community."
      }
    },
    {
      "group": "Permissiveness",
      "start_date": {
        "year": "2023",
        "month": "8"
      },
      "text": {
        "headline": "OpenTofu initiative announced",
        "text": "In response to Terraform's license change, the OpenTofu initiative is announced by Gruntwork, Spacelift, and others, pledging to maintain a truly open source fork under the Linux Foundation."
      }
    },
    {
      "group": "Permissiveness",
      "start_date": {
        "year": "2024",
        "month": "1"
      },
      "text": {
        "headline": "OpenTofu goes GA as Terraform fork",
        "text": "OpenTofu 1.6.0 is released as a stable, drop-in replacement for Terraform, demonstrating the community's ability to fork and maintain infrastructure tooling when licenses become restrictive."
      }
    },
    {
      "group": "Permissiveness",
      "start_date": {
        "year": "2024",
        "month": "4"
      },
      "text": {
        "headline": "Valkey and KeyDB emerge as Redis forks",
        "text": "The Linux Foundation launches Valkey as an open source fork of Redis, while KeyDB and other community forks gain traction following Redis' license change."
      }
    },
    {
      "group": "Proprietariness",
      "start_date": {
        "year": "2024",
        "month": "3"
      },
      "text": {
        "headline": "Redis changes to dual-license RSALv2/SSPL",
        "text": "Redis Ltd. announces that Redis 7.4 and later will be dual-licensed under RSALv2 and SSPL, ending Redis' open source era and prompting community forks like Valkey."
      }
    },
    {
      "group": "Events",
      "start_date": {
        "year": "2024"
      },
      "text": {
        "headline": "GenAI disruption",
        "text": "Hyperscalers (MSFT/GitHub/OpenAI) form billion-dollar AI partnerships, cementing a downstream, permissive-dependent AI monopolization model."
      }
    },
    {
      "group": "Events",
      "start_date": {
        "year": "2024",
        "month": "10",
        "day": "28"
      },
      "text": {
        "headline": "OSI releases Open Source AI Definition v1.0",
        "text": "The Open Source Initiative publishes the first official Open Source AI Definition, establishing criteria for what constitutes open source AI systems, including requirements for training data disclosure."
      }
    },
    {
      "group": "Permissiveness",
      "start_date": {
        "year": "2025"
      },
      "text": {
        "headline": "Next-generation licensing debates intensify",
        "text": "As AI continues to reshape software development, new licensing models emerge to address training data rights, model weights distribution, and the tension between innovation and attribution in the age of generative AI."
      }
    }
  ]
}